## PANDAS

## import pandas library

In [1]:
import pandas as pd

In [2]:
import numpy as np

In [5]:
val = np.linspace(0,1,10)

In [6]:
ind = ['a','b','c','d','e','f','g','h','i','j']

## Series

One-dimensional ndarray with axis labels (including time series).

In [7]:
data = pd.Series(val,ind)
data

a    0.000000
b    0.111111
c    0.222222
d    0.333333
e    0.444444
f    0.555556
g    0.666667
h    0.777778
i    0.888889
j    1.000000
dtype: float64

In [8]:
data.index

Index(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'], dtype='object')

In [9]:
data.values

array([0.        , 0.11111111, 0.22222222, 0.33333333, 0.44444444,
       0.55555556, 0.66666667, 0.77777778, 0.88888889, 1.        ])

## DataFrame

Two-dimensional size-mutable, potentially heterogeneous tabular data
structure with labeled axes (rows and columns). Can be thought of as a dict-like
container for Series objects. The primary pandas data structure.

In [10]:
dict = {'Emp':['John', 'Marry','Joseph'],
        'ID':[101,102,103],
         'Age' : [22,34,29]}

In [11]:
dict

{'Emp': ['John', 'Marry', 'Joseph'],
 'ID': [101, 102, 103],
 'Age': [22, 34, 29]}

In [12]:
ind = ['a','b','c']

In [13]:
df1 = pd.DataFrame(dict,ind)
df1

      Emp   ID  Age
a    John  101   22
b   Marry  102   34
c  Joseph  103   29

In [14]:
#to fetch Emp column
df1['Emp']

a      John
b     Marry
c    Joseph
Name: Emp, dtype: object

In [15]:
#to extract multiple column
df1[['Emp','ID']]

      Emp   ID
a    John  101
b   Marry  102
c  Joseph  103

In [16]:
#to extract rows
df1[1:2]

     Emp   ID  Age
b  Marry  102   34

## slicing using loc
## loc function is used to select columns by names

In [19]:
df1.loc[:, ['Emp']]

      Emp
a    John
b   Marry
c  Joseph

## iloc method uses the index instead of the columns name

In [22]:
##extracting all rows and columns till 2nd column where 2 is exclusive
df1.iloc[:, :]

      Emp   ID  Age
a    John  101   22
b   Marry  102   34
c  Joseph  103   29

## Concatenation
## we can concatenate two DataFrames using function pd.concat()

In [23]:
df1 = pd.DataFrame(dict,ind)
df1

      Emp   ID  Age
a    John  101   22
b   Marry  102   34
c  Joseph  103   29

In [24]:
df2 = pd.DataFrame({'Emp': ['Alan', 'Smith'],
                     'ID': [201,202],
                     'Age':[32,27]}, index = ['d','e'])
df2

     Emp   ID  Age
d   Alan  201   32
e  Smith  202   27

In [26]:
con = pd.concat([df1,df2])
con

      Emp   ID  Age
a    John  101   22
b   Marry  102   34
c  Joseph  103   29
d    Alan  201   32
e   Smith  202   27

## Reading csv file

In [56]:
df = pd.read_csv(r'C:\Users\DELL\Downloads\insurance.csv')

In [57]:
#to view the first few records
#df.iloc[10:20,:]
df.head()

    age     sex     bmi  children smoker     region      charges
0  19.0  female  27.900         0    yes  southwest  16884.92400
1  18.0    male  33.770         1     no  southeast   1725.55230
2  28.0    male  33.000         3     no  southeast   4449.46200
3  33.0    male  22.705         0     no  northwest  21984.47061
4  32.0    male  28.880         0     no  northwest   3866.85520

In [58]:
#getting info about the dataset
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1338 entries, 0 to 1337
Data columns (total 7 columns):
age         1334 non-null float64
sex         1338 non-null object
bmi         1338 non-null float64
children    1338 non-null int64
smoker      1338 non-null object
region      1338 non-null object
charges     1338 non-null float64
dtypes: float64(3), int64(1), object(3)
memory usage: 73.2+ KB

In [48]:
#understanding the variables
df.describe()

               age          bmi     children       charges
count  1334.000000  1338.000000  1338.000000   1338.000000
mean     39.233883    30.663397     1.094918  13270.422265
std      14.053403     6.098187     1.205493  12110.011237
min      18.000000    15.960000     0.000000   1121.873900
25%      27.000000    26.296250     0.000000   4740.287150
50%      39.000000    30.400000     1.000000   9382.033000
75%      51.000000    34.693750     2.000000  16639.912515
max      64.000000    53.130000     5.000000  63770.428010

In [49]:
#to check for null values
df.isnull().sum()

age         4
sex         0
bmi         0
children    0
smoker      0
region      0
charges     0
dtype: int64

In [ ]:
df.dropna()

In [61]:
df1 = df.fillna(1)

In [64]:
df1.isnull().sum()

age         0
sex         0
bmi         0
children    0
smoker      0
region      0
charges     0
dtype: int64

In [65]:
df.shape

(1338, 7)

In [66]:
#generate relationships between each continuous variables
df.corr()

               age       bmi  children   charges
age       1.000000  0.108932  0.043629  0.298006
bmi       0.108932  1.000000  0.012759  0.198341
children  0.043629  0.012759  1.000000  0.067998
charges   0.298006  0.198341  0.067998  1.000000

In [67]:
df.max()

age                64
sex              male
bmi             53.13
children            5
smoker            yes
region      southwest
charges       63770.4
dtype: object

## groupby()
## split the data into groups based on some criteria

In [72]:
gb = df.groupby('children')
print(gb)

<pandas.core.groupby.groupby.DataFrameGroupBy object at 0x0000026D4926B080>

In [73]:
#prints the 1st value/row for each group
#gb.first()
gb.head()

      age     sex     bmi  children smoker     region      charges
0    19.0  female  27.900         0    yes  southwest  16884.92400
1    18.0    male  33.770         1     no  southeast   1725.55230
2    28.0    male  33.000         3     no  southeast   4449.46200
3    33.0    male  22.705         0     no  northwest  21984.47061
4    32.0    male  28.880         0     no  northwest   3866.85520
5    31.0  female  25.740         0     no  southeast   3756.62160
6    46.0  female  33.440         1     no  southeast   8240.58960
7    37.0  female  27.740         3     no  northwest   7281.50560
8    37.0    male  29.830         2     no  northeast   6406.41070
9    60.0  female  25.840         0     no  northwest  28923.13692
15   19.0    male  24.600         1     no  southwest   1837.23700
16   52.0  female  30.780         1     no  northeast  10797.33620
21   30.0  female  32.400         1     no  southwest   4149.73600
24    NaN    male  28.025         2     no  northwest   6203.90175
25   59.0  female  27.720         3     no  southeast  14001.13380
27   55.0  female  32.775         2     no  northwest  12268.63225
29   31.0    male  36.300         2    yes  southwest  38711.00000
32   19.0  female  28.600         5     no  southwest   4687.79700
36   62.0  female  32.965         3     no  northwest  15612.19335
41   31.0  female  36.630         2     no  southeast   4949.75870
54   40.0  female  28.690         3     no  northwest   8059.67910
61    NaN    male  33.660         4     no  southeast   4504.66240
71   31.0    male  28.500         5     no  northeast   6799.45800
83   48.0  female  41.230         4     no  northwest  11033.66170
165  47.0    male  28.215         4     no  northeast  10407.08585
166  20.0  female  37.000         5     no  southwest   4830.63000
211  40.0    male  30.875         4     no  northwest   8162.71625
258  51.0    male  24.415         4     no  northwest  11520.09985
413  25.0    male  23.900         5     no  southwest   5080.09600
425  45.0    male  24.310         5     no  southeast   9788.86590